tukano-artillery-tests/logs/users-15-hibernate.txt
--------------------------------
Summary report @ 20:28:19(+0000)
--------------------------------

http.codes.200: ................................................................ 450
http.downloaded_bytes: ......................................................... 3044
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 22
  max: ......................................................................... 1630
  mean: ........................................................................ 100.4
  median: ...................................................................... 47.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 1326.4
http.response_time.2xx:
  min: ......................................................................... 22
  max: ......................................................................... 1630
  mean: ........................................................................ 100.4
  median: ...................................................................... 47.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 1326.4
http.responses: ................................................................ 450
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 450
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 22
  max: ......................................................................... 1630
  mean: ........................................................................ 100.4
  median: ...................................................................... 47.9
  p95: ......................................................................... 301.9
  p99: ......................................................................... 1326.4
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 188.6
  max: ......................................................................... 2448.8
  mean: ........................................................................ 309.4
  median: ...................................................................... 228.2
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1587.9