tukano-artillery-tests/logs/users-33-hibernate.txt
--------------------------------
Summary report @ 19:36:36(+0000)
--------------------------------

http.codes.200: ................................................................ 990
http.downloaded_bytes: ......................................................... 6824
http.request_rate: ............................................................. 33/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 2806
  mean: ........................................................................ 199.3
  median: ...................................................................... 48.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 2465.6
http.response_time.2xx:
  min: ......................................................................... 3
  max: ......................................................................... 2806
  mean: ........................................................................ 199.3
  median: ...................................................................... 48.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 2465.6
http.responses: ................................................................ 990
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 990
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 3
  max: ......................................................................... 2806
  mean: ........................................................................ 199.3
  median: ...................................................................... 48.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 2465.6
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 190.2
  max: ......................................................................... 2967.4
  mean: ........................................................................ 404.6
  median: ...................................................................... 219.2
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 2671
ubuntu@virtual:~/Desktop$