tukano-artillery-tests/logs/users-5-hibernate.txt
--------------------------------
Summary report @ 19:05:21(+0000)
--------------------------------

http.codes.200: ................................................................ 150
http.downloaded_bytes: ......................................................... 944
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 45
  max: ......................................................................... 956
  mean: ........................................................................ 68.1
  median: ...................................................................... 50.9
  p95: ......................................................................... 141.2
  p99: ......................................................................... 301.9
http.response_time.2xx:
  min: ......................................................................... 45
  max: ......................................................................... 956
  mean: ........................................................................ 68.1
  median: ...................................................................... 50.9
  p95: ......................................................................... 141.2
  p99: ......................................................................... 301.9
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 150
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 45
  max: ......................................................................... 956
  mean: ........................................................................ 68.1
  median: ...................................................................... 50.9
  p95: ......................................................................... 141.2
  p99: ......................................................................... 301.9
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 198.1
  max: ......................................................................... 1121.3
  mean: ........................................................................ 252.1
  median: ...................................................................... 223.7
  p95: ......................................................................... 424.2
  p99: ......................................................................... 478.3