tukano-artillery-tests/logs/users-nosql-15.txt
--------------------------------
Summary report @ 12:32:50(+0000)
--------------------------------

http.codes.200: ................................................................ 450
http.downloaded_bytes: ......................................................... 3044
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 222
  max: ......................................................................... 931
  mean: ........................................................................ 254.1
  median: ...................................................................... 242.3
  p95: ......................................................................... 262.5
  p99: ......................................................................... 632.8
http.response_time.2xx:
  min: ......................................................................... 222
  max: ......................................................................... 931
  mean: ........................................................................ 254.1
  median: ...................................................................... 242.3
  p95: ......................................................................... 262.5
  p99: ......................................................................... 632.8
http.responses: ................................................................ 450
plugins.metrics-by-endpoint./rest/users/.codes.200: ............................ 450
plugins.metrics-by-endpoint.response_time./rest/users/:
  min: ......................................................................... 222
  max: ......................................................................... 931
  mean: ........................................................................ 254.1
  median: ...................................................................... 242.3
  p95: ......................................................................... 262.5
  p99: ......................................................................... 632.8
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 646.1
  max: ......................................................................... 1352.7
  mean: ........................................................................ 689.8
  median: ...................................................................... 671.9
  p95: ......................................................................... 727.9
  p99: ......................................................................... 1064.4